---
kind: other
id: Properties.T:Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
source: html/aced8398-8f9f-5617-e483-ab40349cd32c.htm
---
# RevitAPIPreEventArgs Properties

Indicates whether an event may be cancelled by an event delegate.